function Pre_My_Whitt(S1,M1,S2,M2,S3,M3)
% 预处理程序
% 使用Whitt算法前，先运行该函数，判断所选定标点信息是否满足条件
%
% 输入变量：
%   1）S1 和 M1 是三面角反射器的散射矩阵和观测矩阵；
%   2）S2 和 M2 是0°二面角反射器的散射矩阵和观测矩阵；
%   3）S3 和 M3 是45°二面角反射器的散射矩阵和观测矩阵；
%   默认为以上顺序，最好不要改变；
% 输出变量：无
%
% 程序截止至：2016.05.18. 19:45

%%
% 数据验证
% 本算法要求至少一个目标的散射矩阵可逆；
% 这里我们假设目标1的散射矩阵是可逆的，即 S1 和 M1 可逆；
% 由于可逆矩阵判定的充要条件是该矩阵的行列式不等于0，下面基于此进行验证：
disp('-------------------------------------------------------------------')
if det(S1)~=0 && det(M1)~= 0
    disp('验证成功，目标1的散射矩阵是可逆的');
else
    disp('！！！  Error  ！！！');
    disp('验证失败，目标1的散射矩阵不可逆');
    disp('请重新选择散射矩阵可逆的目标作为参考');
    return;
end

%%
M_T12 = M1\M2;
S_T12 = S1\S2;
M_T13 = M1\M3;
S_T13 = S1\S3;

% 在进行后续操作前，先要验证如下关系：
%   1）验证 S_T12
disp('-------------------------------------------------------------------')
if 4*det(S_T12) ~= (S_T12(1,1)+S_T12(2,2))^2
    disp('S_T12 验证成功，可以继续进行后续操作');
else
    disp('！！！  Error  ！！！');
    disp('验证失败，请重新选择满足条件的定标目标');
    return;
end
%   2）验证 S_T13
disp('-------------------------------------------------------------------')
if 4*det(S_T13) ~= (S_T13(1,1)+S_T13(2,2))^2
    disp('S_T13 验证成功，可以继续进行后续操作');
else
    disp('！！！  Error  ！！！');
    disp('验证失败，请重新选择满足条件的定标目标');
    return;
end

%%
M_R12 = M2/M1;
S_R12 = S2/S1;

M_R13 = M3/M1;
S_R13 = S3/S1;

% 在进行后续操作前，先要验证如下关系：
%   1）验证 S_R12
disp('-------------------------------------------------------------------')
if 4*det(S_R12) ~= (S_R12(1,1)+S_R12(2,2))^2
    disp('S_R12 验证成功，可以继续进行后续操作');
else
    disp('！！！  Error  ！！！');
    disp('验证失败，请重新选择满足条件的定标目标');
    return;
end
%   2）验证 S_R13
disp('-------------------------------------------------------------------')
if 4*det(S_R13) ~= (S_R13(1,1)+S_R13(2,2))^2
    disp('S_R13 验证成功，可以继续进行后续操作');
else
    disp('！！！  Error  ！！！');
    disp('验证失败，请重新选择满足条件的定标目标');
    return;
end

%%
disp('-------------------------------------------------------------------')
disp('定标点信息验证完成，满足条件，可进行后续定标处理');
disp('-------------------------------------------------------------------')

end